Dlubal.RFEM5.ModelObjectType
Type of model data objects

Dlubal.RFEM5.ModelObjectType.UnknownObject
Unknown object type

Dlubal.RFEM5.ModelObjectType.NodeObject
Node

Dlubal.RFEM5.ModelObjectType.LineObject
Line

Dlubal.RFEM5.ModelObjectType.MaterialObject
Material

Dlubal.RFEM5.ModelObjectType.SurfaceObject
Surface

Dlubal.RFEM5.ModelObjectType.SolidObject
Solid

Dlubal.RFEM5.ModelObjectType.OpeningObject
Opening

Dlubal.RFEM5.ModelObjectType.CavityObject
Cavite

Dlubal.RFEM5.ModelObjectType.NodalSupportObject
Nodal Support

Dlubal.RFEM5.ModelObjectType.LineSupportObject
Line Support

Dlubal.RFEM5.ModelObjectType.SurfaceSupportObject
Surface Support

Dlubal.RFEM5.ModelObjectType.LineHingeObject
Line Hinge

Dlubal.RFEM5.ModelObjectType.CrossSectionObject
Cross-Section

Dlubal.RFEM5.ModelObjectType.MemberHingeObject
Member Hinge

Dlubal.RFEM5.ModelObjectType.MemberEccentricityObject
Member Eccentricity

Dlubal.RFEM5.ModelObjectType.MemberDivisionObject
Member Division

Dlubal.RFEM5.ModelObjectType.MemberObject
Member

Dlubal.RFEM5.ModelObjectType.RibObject
Rib

Dlubal.RFEM5.ModelObjectType.MemberElasticFoundationObject
Member Elastic Foundation

Dlubal.RFEM5.ModelObjectType.MemberNonlinearityObject
Member Nonlinearity

Dlubal.RFEM5.ModelObjectType.SetOfMembersObject
Set of Members

Dlubal.RFEM5.ModelObjectType.IntersectionOfSurfacesObject
Intersection of Surfaces

Dlubal.RFEM5.ModelObjectType.IntersectionOfSolidsObject
Intersection of Solids

Dlubal.RFEM5.ModelObjectType.FeMeshRefinementObject
FE Mesh Refinement

Dlubal.RFEM5.ModelObjectType.NodalReleaseObject
Nodal Release

Dlubal.RFEM5.ModelObjectType.LineReleaseTypeObject
Line Release Type

Dlubal.RFEM5.ModelObjectType.LineReleaseObject
Line Release

Dlubal.RFEM5.ModelObjectType.ConnectionEccentricityObject
Connection Eccentricity

Dlubal.RFEM5.ModelObjectType.ConnectionOfTwoMembersObject
Connection of Two Members

Dlubal.RFEM5.ModelObjectType.JointObject
Joints

Dlubal.RFEM5.ModelObjectType.TendonObject
Tendon